// Программа: Fill.asm
// В бесконечном цикле слушает ввод с клавиатуры.
// Когда клавиша нажата (любая), программа закрашивает экран в черный,
// то есть записывает "черный" в каждый пиксель;
// экран должен оставаться черным пока клавиша нажата. 
// Когда клавиша не нажата программа очищает экран,
// то есть записывает "белый" в каждый пиксель;
// экран должен оставаться белым пока клавиша не нажата.

// Перед написанием программы прочитайте README.md файл,
// он находится в папке с этим проектом.

// Вы также можете изучить программу Rect.asm, запустите ее.
// Файл Rect.asm находится рядом с этим файлом.
// Программа запускается в симуляторе процессора,
// подробнее об этом написано в конце README инструкции.

// Чтобы запустить программу — откройте Fill.tst файл в симуляторе CPU
// ctrl+shift+p или cmd+shift+p — Nand2Tetris: Open CPU Simulator

// При запуске программы не забудьте включить опцию `Animate: no animation`
// в симуляторе процессора.

// Пишите код ниже: